{
    "tips-warnings": [
        "Cleaned eel filets will be sold at most large supermarkets. If you’re struggling to find eel filets, check in a nearby Asian grocery store."
    ],
    "related": [
        "How to Cook Cod Fillets",
        "How to Bake Cod",
        "How to Bake Codfish",
        "How to Cook Tilapia in the Oven",
        "How to Cook Smoked Haddock",
        "How to Purge Crawfish",
        "How to Cook Octopus",
        "How to Cook Oysters",
        "How to Cook Catfish",
        "How to Eat a Crawfish",
        "How to Cook Cod Fillets",
        "How to Bake Cod",
        "How to Bake Codfish",
        "How to Cook Tilapia in the Oven"
    ],
    "intro": "Eel is a delicious source of flaky, sweet meat, which can be prepared in various ways. If you’re purchasing eel from a supermarket, you can cook the eel as soon as you bring it home. Cook the eel by roasting it in your oven, smoking it, or frying it in a pan on your stove.",
    "parts": [
        {
            "part": "Method 1 Roasting the Eel",
            "steps": [
                {
                    "sub-steps": [
                        {
                            "sub-step": "Preheating the oven before you prepare the eel will allow oven to get up to its proper temperature before you put the eel in."
                        }
                    ],
                    "step": "Preheat your oven to 375 째F (191 째C).",
                    "tips": []
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "In case there is any residual blood or water within the eel’s body cavity, use 1 or 2 paper towels to dry out the inside of the eel."
                        }
                    ],
                    "step": "Pat the eel dry using paper towels.",
                    "tips": [
                        "Throw these paper towels away immediately."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Use your hands to massage the salt over the eel’s flesh. Fully coat both the outside and the inside of the eel with salt."
                        }
                    ],
                    "step": "Rub 1 teaspoon (4.9 mL) of salt over the eel.",
                    "tips": [
                        "Modify this measurement for the number of eels you’re roasting. So, if you’re preparing 3 eels, you’ll need 3 teaspoons (15 ml) of salt total."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Drizzle with 3 teaspoons (15 mL) of vegetable oil. If you don’t have vegetable oil, olive oil makes a suitable replacement."
                        }
                    ],
                    "step": "Place the eel into a cast iron skillet.",
                    "tips": [
                        "Alternately, if you have a roasting pan, you can place the eel in this to roast."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "When the eel is cooked, the skin will be browned and ready to eat."
                        }
                    ],
                    "step": "Put the skillet in the oven and roast the eel for 25-30 minutes.",
                    "tips": [
                        "Once 25 minutes have passed, keep a close watch on the eel to ensure that it doesn’t begin to blacken and burn."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Top the eel with lemon, salt and pepper, and any other sauce or garnish that you enjoy."
                        }
                    ],
                    "step": "Serve the roast eel immediately.",
                    "tips": [
                        "Place leftovers into an airtight container and store in the refrigerator. The eel should keep for 3 or 4 days."
                    ]
                }
            ]
        },
        {
            "part": "Method 2 Smoking Eel",
            "steps": [
                {
                    "sub-steps": [
                        {
                            "sub-step": "Combine 1 quart (0.95 L) of water with cup (59 mL) of salt. Make the brine in a large bowl or Tupperware container."
                        }
                    ],
                    "step": "Prepare a brine to soak the eel.",
                    "tips": [
                        "Once you’ve made the basic brine, add whatever herbs you’d like to flavor the eel. Appropriate herbs include oregano, rosemary, or parsley.",
                        "For additional flavor, add a squeeze of lemon juice to the brine. Add this to taste."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Fully submerge the eel in the container of brine and place it in the refrigerator. Let it soak undisturbed for a night."
                        }
                    ],
                    "step": "Soak the eel in brine overnight in your fridge.",
                    "tips": [
                        "If you soak the eel during the day instead, make sure that it soaks in brine for a full 8-10 hours."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Eel meat is delicate and needs to be smoked at a low temperature."
                        }
                    ],
                    "step": "Preset the smoker to 185 째F (85 째C).",
                    "tips": []
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Alder and apple are both mild, sweet woods that will complement the light flavor of the eel."
                        }
                    ],
                    "step": "Place apple or alder wood chips in the smoking box.",
                    "tips": [
                        "If you’d like to make sure that the temperature in the smoker stays low, smoke the wood chips before placing them in the smoker."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "If your smoker is equipped to hang meats for smoking, hang the eel filets."
                        }
                    ],
                    "step": "Hang the eel filets to smoke.",
                    "tips": [
                        "If the eels’ heads are still attached, tie a thin rope around the heads and hang the filets by the head to smoke."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "If your smoker doesn’t have the capability to hang meat for smoking, lay your eel filets flat instead. Positioning them with the belly side up will allow the tender interior of the filet to cook through."
                        }
                    ],
                    "step": "Lay the eel filets belly-up on the smoking rack if you can’t hang the filets.",
                    "tips": [
                        "To make sure that the back and sides of the filets cook as well, try placing the eel on a baking sheet."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Eel filets are light, delicate meat, and will smoke relatively quickly. Keep an eye on the filets as they cook to make sure that they don’t burn. Pull the filets out of the smoker once they’ve turned flaky and browned."
                        }
                    ],
                    "step": "Smoke the eel for 90 minutes.",
                    "tips": []
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Since the filets will have been smoking at a relatively low temperature, they won’t need to cool before you can begin to eat them."
                        }
                    ],
                    "step": "Serve the filets immediately.",
                    "tips": [
                        "Store leftover smoked eel in an airtight bag or plastic container in your refrigerator. It will keep for 3-4 days."
                    ]
                }
            ]
        },
        {
            "part": "Method 3 Frying Eel Filets",
            "steps": [
                {
                    "sub-steps": [
                        {
                            "sub-step": "Use a sharp kitchen knife to slice both eel filets into pieces for frying. Leave the skin on the eel."
                        }
                    ],
                    "step": "Cut the filets into 6 cm (2.4 in) chunks.",
                    "tips": [
                        "If the filets still have the head and tail attached, cut these parts off and discard them."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Placed the sliced eel pieces into a colander, and rinse them off in your kitchen sink. Rinse the eel under cold water from the tap."
                        }
                    ],
                    "step": "Rinse the eel chunks under cold water.",
                    "tips": [
                        "Lightly toss the eel while you’re rinsing it to ensure that it’s fully rinsed."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "In a large mixing bowl, combine 50 grams (1.8 oz) of corn flower and 100 grams (3.5 oz) of white flower."
                        }
                    ],
                    "step": "Combine the two types of flour.",
                    "tips": [
                        "Both types of flour will be available at your local grocery store."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Pick up the eel pieces individually and set each one in the bowl of flour. Use your fingers to roll the eel chunk over in the flour mixture until all sides are fully coated."
                        }
                    ],
                    "step": "Roll the eel filet chunks in the flour mixture.",
                    "tips": [
                        "After rolling a piece of eel in the flour mixture, set it aside on a clean bowl or plate until you’re ready to start frying."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Also pull out a lid for the skillet. You’ll want to keep the eel covered while it’s frying, so that hot peanut oil doesn’t splatter."
                        }
                    ],
                    "step": "Pour 1⁄2 cup (120 mL) of peanut oil into a large skillet.",
                    "tips": [
                        "You can purchase peanut oil at a local supermarket."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Since eel is a delicate meat, high heat will cause the filet pieces to burn. To keep the heat low, set the burner to 3 or 4. Place the floured eel pieces into the oil, and use a fork or tongs to turn them over every 2 or 3 minutes. Remember to replace the lid on the skillet after every time you flip the eel pieces."
                        }
                    ],
                    "step": "Fry the eels over low heat for 10 minutes.",
                    "tips": [
                        "The eel will be cooked through inside after 10 minutes."
                    ]
                },
                {
                    "sub-steps": [
                        {
                            "sub-step": "Paper towels will absorb extra peanut oil that may still be on the eel pieces. Let them cool for about 5 minutes."
                        }
                    ],
                    "step": "Place the fried eels on paper towels to cool.",
                    "tips": [
                        "Once the eels have cooled, sprinkle them to taste with salt and serve immediately.",
                        "Store leftover fried eel in an airtight plastic container. Keep it chilled in your refrigerator."
                    ]
                }
            ]
        }
    ],
    "ingredients-thingsneeded": [
        {
            "part-ingredients": [
                "1 eel filet",
                "1 teaspoon (4.9 mL) of salt",
                "3 teaspoons (15 mL) of vegetable oil"
            ],
            "part-name": "Roasted Eel[1]"
        },
        {
            "part-ingredients": [
                "1 eel filet",
                "Apple or alder wood chips",
                "1 quart (0.95 L) of water",
                "1⁄4 cup (59 mL) of salt"
            ],
            "part-name": "Smoked Eel[2]"
        },
        {
            "part-ingredients": [
                "2 eel filets",
                "50 grams (1.8 oz) of corn flower",
                "100 grams (3.5 oz) of white flower",
                "2 bay leaves",
                "1⁄2 cup (120 mL) of peanut oil",
                "salt"
            ],
            "part-name": "Fried Eel Filets[3]"
        }
    ],
    "title": "How to Cook Eel",
    "category": [
        "Food and Entertaining",
        "Recipes",
        "Fish and Seafood"
    ],
    "structure": "Methods"
}